{
  "role": "Desarrollador Full-Stack",
  "nav": {
    "about": "Sobre Mí",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "language": {
    "select": "Idioma"
  },
  "tech": {
    "flutter": "Flutter",
    "python": "Python",
    "socketio": "Socket.io",
    "javascript": "JavaScript",
    "react": "React",
    "googlemaps": "Google Maps API",
    "nodejs": "Node.js",
    "database": "Bases de Datos",
    "api": "APIs RESTful",
    "sqlite": "SQLite",
    "beautifulsoup": "BeautifulSoup",
    "html": "HTML/CSS",
    "responsive": "Responsive Design",
    "docx": "python-docx",
    "voice": "Reconocimiento de Voz",
    "ai": "Inteligencia Artificial",
    "pyqt": "PyQt5",
    "gemini": "Google Gemini"
  },
  "project5": {
    "title": "Scraper de Excel",
    "desc": "Herramienta para consolidación automática de datos desde múltiples archivos Excel. Procesa y combina información de diferentes fuentes, aplicando reglas de negocio y generando reportes personalizados."
  },
  "project-view": "Ver Proyecto",
  "about": {
    "title": "Sobre Mí",
    "subtitle": "Desarrollador Full-Stack especializado en soluciones innovadoras y sistemas de alto rendimiento",
    "who": "Quién soy",
    "whoText": "Soy un desarrollador full-stack con experiencia demostrada en el desarrollo de soluciones completas desde aplicaciones móviles con comunicación en tiempo real hasta sistemas de IA conversacional en producción. Mi experiencia abarca desarrollo web moderno (React/Flask), aplicaciones móviles nativas, sistemas de escritorio multiplataforma (PyQt), y automatización inteligente con IA. He desarrollado desde herramientas de web scraping y procesamiento multimedia hasta sistemas educativos y médicos que generan impacto real con reducciones de tiempo del 85-95%.",
    "approach": "Mi enfoque",
    "approachText": "Me especializo en crear arquitecturas escalables y sistemas de alto rendimiento, desde aplicaciones de baja latencia con WebSockets hasta interfaces conversacionales con IA adaptable a múltiples proveedores. Combino diseño UX/UI optimizado con backend robusto, priorizando tanto la experiencia de usuario como la eficiencia técnica. Mi experiencia incluye algoritmos complejos, procesamiento de datos en tiempo real, integración de APIs múltiples, y desarrollo responsive. Cada proyecto está diseñado para ser mantenible, escalable y preparado para evolucionar con nuevas tecnologías."
  },
  "skills": {
    "title": "Mis Habilidades",
    "subtitle": "Stack tecnológico completo con experiencia demostrada en proyectos reales",
    "automation": "Desarrollo Full-Stack y Arquitecturas Modernas",
    "automationList": {
      "item1": "React/Flask para aplicaciones web escalables con APIs REST",
      "item2": "PyQt5 para aplicaciones de escritorio multiplataforma",
      "item3": "Arquitecturas con separación de capas y patrones de diseño avanzados"
    },
    "backend": "Aplicaciones Móviles y Comunicación en Tiempo Real",
    "backendList": {
      "item1": "Desarrollo móvil nativo con comunicación WebSocket de baja latencia",
      "item2": "Sistemas de tiempo real con gestos multitáctiles y interfaces adaptativas",
      "item3": "Optimización de rendimiento y experiencia de usuario móvil"
    },
    "frontend": "Inteligencia Artificial y Automatización Inteligente",
    "frontendList": {
      "item1": "IA conversacional con múltiples proveedores (Google Gemini, APIs locales)",
      "item2": "Procesamiento de lenguaje natural y routing inteligente de intenciones",
      "item3": "Sistemas de reconocimiento de voz y interfaces multimodales"
    },
    "devops": "Diseño Web y Experiencia de Usuario",
    "devopsList": {
      "item1": "Diseño responsive y UX/UI optimizado para conversión",
      "item2": "Landing pages y sitios corporativos con marketing digital",
      "item3": "Optimización de rendimiento web y SEO técnico"
    },
    "additional": "Automatización y Procesamiento de Datos",
    "additionalList": {
      "item1": "Web scraping avanzado y monitoreo automatizado de precios",
      "item2": "Procesamiento multimedia y descarga de contenido de redes sociales",
      "item3": "Algoritmos geográficos, matrices de distancia y optimización de rutas"
    }
  },
  "projects": {
    "title": "Mis Proyectos",
    "subtitle": "Algunos de mis trabajos más recientes",
    "filters": {
      "all": "Todos",
      "automation": "Automatización",
      "webApps": "Aplicaciones Web",
      "webDesign": "Diseño Web",
      "mobile": "Móvil",
      "desktop": "Escritorio",
      "ai": "Inteligencia Artificial"
    },
    "viewProject": "Ver Proyecto",
    "viewPortfolio": "Ver Portfolio Completo",
    "project1": {
      "name": "RTX Scraper",
      "title": "Scraper de Tarjetas RTX",
      "desc": "Herramienta automatizada para el seguimiento de precios de tarjetas gráficas RTX en múltiples tiendas."
    },
    "project2": {
      "name": "Remote Mouse",
      "title": "Remote Mouse",
      "desc": "Aplicación móvil para control remoto del cursor con latencia ultra baja. Incluye gestos multitáctiles, teclado virtual y accesos rápidos personalizables."
    },
    "project3": {
      "name": "Social Media Downloader",
      "title": "Descargador de Videos",
      "desc": "Plataforma web para descargar videos de redes sociales sin publicidad ni marcas de agua. Soporta múltiples formatos y calidades, con procesamiento en paralelo para mayor velocidad."
    },
    "project4": {
      "name": "Distance Calculator",
      "title": "Calculadora de Distancias",
      "desc": "Herramienta web para calcular matrices de distancia entre múltiples puntos usando la API de Google Maps. Ideal para optimización de rutas y logística."
    },
    "project5": {
      "name": "Sistema Universal de Validación Excel",
      "title": "Sistema Universal de Validación y Visualización de Tablas Excel",
      "desc": "Plataforma integral que automatiza la extracción, combinación, validación y presentación de tablas educativas en Excel, con arquitectura compartida entre app de escritorio (PyQt) y interfaz web moderna (React + Flask)."
    },
    "portfolioWebs": {
      "name": "Portfolio Webs Comerciales",
      "title": "Diseño Web & Marketing",
      "desc": "Colección completa de sitios web comerciales, landing pages y sitios corporativos. Especializado en diseño responsive, UX/UI optimizado para conversión y marketing digital. +15 proyectos web desplegados en GitHub Pages."
    },
    "project6": {
      "name": "Sistema de Licencias Médicas",
      "title": "Automatización de Licencias Médicas",
      "desc": "Sistema de automatización para el llenado de formatos de licencias médicas oficiales. Elimina la captura manual, reduce errores y acelera el proceso de generación de documentos con múltiples interfaces de captura y reconocimiento de voz."
    },
    "project7": {
      "name": "Sistema de Constancias Escolares con IA",
      "title": "Sistema de Constancias Escolares con IA",
      "desc": "Aplicación de escritorio con IA que automatiza constancias y gestión escolar. Master Interpreter con routing inteligente, generación PDF y interfaz conversacional natural. En producción con arquitectura escalable y robusta."
    }
  },
  "contact": {
    "title": "Contacto",
    "subtitle": "¿Interesado en colaborar en un proyecto o tienes alguna pregunta?",
    "form": {
      "name": "Tu nombre",
      "email": "Tu correo electrónico",
      "subject": "Asunto",
      "message": "Mensaje",
      "send": "Enviar Mensaje"
    }
  }
}






